Repository: rrabiela/rabiela
Catalog: sites/default/files/translations/dropdown_language-8.x-2.7.*.po
Languages: de

source: Configuration
de: Konfiguration

source: Other
de: Weitere

source: Troubleshooting
de: Fehlersuche

source: Native Name
de: Nativer Name

source: Custom Blocks
de: Benutzerdefinierte Blöcke

source: Dropdown Language Switcher
de: Sprachumschalter-Dropdown

source: Provides a block with a Dropdown Language Switcher
de: Ermöglicht es einen Block mit einem Dropdown-Sprachumschalter bereitzustellen

source: Dropdown Language Settings
de: Spracheinstellungen des Dropdowns

source: Use Fieldset wrapping around Dropdown
de: Dropdown mit Feldgruppe umgeben

source: Switch Language
de: Sprache wechseln

source: Dropdown Language Selector
de: Sprachumscahlter-Dropdown

source: Display Language Labelling
de: Bezeichnung der Sprache Anzeigen

source: Dropdown language switcher block
de: Sprachumschalter-Block

source: Languages labels for display in dropdown block
de: Sprachbeschriftungen für die Anzeige im Dropdown-Block

source: Dropdown language label
de: Beschriftung des Sprachumscahlters

source: Dropdown language settings
de: Sprachumschaltereinsellungen

source: Show block with fieldset wrapping
de: Block mit Feldgruppeenumrandung anzeigen

source: General Settings for all Dropdown Language Blocks
de: Allgemeine Einstellungen für alle Dropdown-Sprachblöcke

source: Custom Labels for Language Names
de: Benutzerdefinierte Beschriftungen für Sprachennamen

source: Label for <q>@lng</q>
de: Beschriftung für <q>@lng</q>

source: Create a unique block instance for each language then assign via Language Visibility per block. This is due to the general idea that you are now changing labels that were otherwise normally translatable strings by using these Custom Labels.
de: Erstellen Sie eine eindeutige Blockinstanz für jede Sprache und weisen Sie diese dann über Language Visibility pro Block zu. Dies ist auf die allgemeine Idee zurückzuführen, dass Sie nun Bezeichnungen, die sonst normalerweise übersetzbare Zeichenfolgen waren, durch diese benutzerdefinierten Bezeichnungen ändern.

source: Language Name
de: Sprachname

source: Language ID
de: Sprach-ID

source: Custom Labels
de: Benutzerdefinierte Beschriftungen

source: Each block instance will provide fields for label names.
de: Jede Blockinstanz stellt Felder für Beschriftungsnamen zur Verfügung.

source: Dropdown Language (@type)
de: Dropdown-Sprache (@type)

source: Dropdown Language Switcher general configurations.
de: Allgemeine Konfigurationen des Dropdown-Sprachumschalters.

source: Remove untranslated nodes
de: Nicht pbersetzte Inhalte entfernen

source: Always shows block
de: Block immer anzeigen

source: Select which label option type
de: Wählen Sie die Art der Beschriftungsoption aus

source: <q>@switch</q> Decor
de: <q>@switch</q> Dekor

source: Filter Untranslated
de: Nicht übersetzte filtern

source: Enhances SEO by not adding links that do not actually exist. Works with Entity based objects.
de: Verbessert die Suchmaschinenoptimierung, indem keine Links hinzugefügt werden, die nicht tatsächlich existieren. Funktioniert mit Entity-basierten Objekten.

source: Remove links if no translation is detected.
de: Links entfernen, wenn keine Übersetzung erkannt wird.

source: Keep block visible if only one language is available
de: Block anzeigen, wenn nur eine Sprache verfügbar ist

source: Placed blocks will not output anything if there is not other translation available. User role access to translation is checked.
de: Platzierte Blöcke werden nicht ausgegeben, wenn keine andere Übersetzung vorhanden ist. Der Zugriff der Benutzerrolle auf die Übersetzung wird geprüft.

source: The <q>Locale</q> module is not enabled. You will need to enable should you need to translate strings via the UI. <a title="Administration → Extend" href="@modules_list">Enable Modules</a>
de: Das Modul <q>Locale</q> ist nicht aktiviert. Sie müssen es aktivieren, wenn Sie Strings über die Benutzeroberfläche übersetzen möchten. <a title="Administration → Erweitern" href="@modules_list">Module aktivieren</a>

source: Language Name used as title attribute
de: Der Name der Sprache wird als Titelattribut verwendet
